app/views/employees/index.html.erb

SELECT `companies`.* FROM `companies`
---
	var sm = new Ext.grid.CheckboxSelectionModel();
	var colModel = [
		new Ext.grid.RowNumberer(),sm,
		 {  dataIndex: 'id',hidden:true}
		,{  dataIndex: 'company',header: '公司', width:100 ,renderer:function(value){
			for (var i in COM){
				company = COM[i];
				if(value == company[0]) return company[1];
			}
		}}
		,{  dataIndex: 'empname',header:'姓名',width:50 }
		,{  dataIndex: 'sex',header:'性别', width:30,renderer:function(value){
			for(var i in SEX){
				sex = SEX[i];
				if (value == sex[0]) return sex[1];
			}
			return value;
		} }
		,{  dataIndex: 'is_insure',header:'社保状态' ,width:50, renderer:function(value){
			var color = (value == 1 ? 'green': (value == 2 ? "red":''));
			for(var i= 0 ; i < STATUS.length ; i++){
				_status = STATUS[i];