app/controllers/cities_controller.rb

SELECT `cities`.* FROM `cities` WHERE `cities`.`parent_id` = 0 ORDER BY lft
---
  def cities_tree(id = params[:node])
     cdata = Array.new
     c = City.find_all_by_parent_id(id || 1 , :order => 'lft')