app/controllers/companies_controller.rb

  def grid
      #@companies = Company.find(:all , pagination_state.merge(options_from_filter()))
      logger.info("===============================")
      @companies = Company.paginate options_from_filter({:data => Company})
---
SELECT COUNT(*) FROM `companies` WHERE (ccname LIKE '%中国光%' AND contact LIKE '%R%')
SELECT `companies`.* FROM `companies` WHERE (ccname LIKE '%中国光%' AND contact LIKE '%R%') LIMIT 20 OFFSET 0

  def delete
      keys = params[:dlist]
      success = false;
      notice = "";
      if not keys.nil?
          begin
            Company.transaction do
                keys.each do |key|
                  if key != ""
                     @company = Company.find(key)
                     @company.destroy
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 30 LIMIT 1
DELETE FROM `companies` WHERE `companies`.`id` = 32

  def edit
    @company = Company.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 31 LIMIT 1

  def create
    @company = Company.new(params[:company])
    @company.py_code = @company.ccode
    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`c_method`, `c_type`, `caddress`, `ccname`, `ccode`, `city_id`, `city_name`, `contact`, `created_at`, `fax`, `insure_base`, `job`, `org_code`, `phone`, `provident_base`, `py_code`, `telphone`, `updated_at`) VALUES ('rea', 'kdjfa', 'asf', 'asdkfjalk', 'SZ09103912', 110000, '北京市', '1', '2012-03-05', NULL, 2341.0, '1', 'aksdfj ', '1', 123.0, 'SZ09103912', '1', '2012-03-05')

  def update
    @company = Company.find(params[:id])

    respond_to do |format|
      if @company.update_attributes(params[:company])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 30 LIMIT 1
UPDATE `companies` SET `phone` = '011111313', `updated_at` = '2012-03-07', `telphone` = '0103131', `job` = '010131' WHERE `companies`.`id` = 31