app/controllers/company_accounts_controller.rb

  def grid
      logger.info("===============================")
      @companyAccount = CompanyAccount.paginate options_from_filter({:data => CompanyAccount})
---
SELECT COUNT(*) FROM `company_accounts`
SELECT `company_accounts`.* FROM `company_accounts` LIMIT 20 OFFSET 0

  def delete
      keys = params[:dlist]
      success = false;
      notice = "";
      if not keys.nil?
          begin
            CompanyAccount.transaction do
                keys.each do |key|
                  if key != ""
                     @companyAccount = CompanyAccount.find(key)
                     @companyAccount.destroy
---
SELECT `company_accounts`.* FROM `company_accounts` WHERE `company_accounts`.`id` = 4 LIMIT 1
DELETE FROM `company_accounts` WHERE `company_accounts`.`id` = 4

  def edit
    @company_account = CompanyAccount.find(params[:id])
---
SELECT `company_accounts`.* FROM `company_accounts` WHERE `company_accounts`.`id` = 5 LIMIT 1

  def create
    @company_account = CompanyAccount.new(params[:company_account])

    respond_to do |format|
      if @company_account.save
---
INSERT INTO `company_accounts` (`city_id`, `city_name`, `company_limit`, `company_lower`, `company_round`, `company_type`, `created_at`, `fix_value`, `hukou`, `item_id`, `rate`, `updated_at`) VALUES (420106, '武昌区', 12.0, 12.0, 1, 1, '2012-03-05', 12.0, 1, 1, 313.0, '2012-03-05')

  def update
    @company_account = CompanyAccount.find(params[:id])

    respond_to do |format|
      if @company_account.update_attributes(params[:company_account])
---
SELECT `company_accounts`.* FROM `company_accounts` WHERE `company_accounts`.`id` = 5 LIMIT 1
UPDATE `company_accounts` SET `rate` = 23.0, `updated_at` = '2012-03-07', `city_id` = 0, `fix_value` = NULL WHERE `company_accounts`.`id` = 3