app/controllers/employees_controller.rb

   def grid
       #@companies = Company.find(:all , pagination_state.merge(options_from_filter()))
       logger.info("===============================")
       @employees = Employee.paginate options_from_filter({:data => Employee})
---
SELECT COUNT(*) FROM `employees` WHERE (is_insure LIKE '%1%' AND is_provident LIKE '%0%')
SELECT `employees`.* FROM `employees` WHERE (is_insure LIKE '%1%' AND is_provident LIKE '%0%') LIMIT 20 OFFSET 0

   def delete
       keys = params[:dlist]
       success = false;
       notice = "";
       if not keys.nil?
           begin
             Employee.transaction do
                 keys.each do |key|
                   if key != ""
                      @employee = Employee.find(key)
                      @employee.destroy
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 10 LIMIT 1
DELETE FROM `employees` WHERE `employees`.`id` = 10

  def edit
    @employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 15 LIMIT 1

  def create
    @employee = Employee.new(params[:employee])
    # @employee.job_begin = "2012-01-01" if @employee.job_begin.blank?
    # @employee.is_insure = 0
    # @employee.is_provident = 0
    respond_to do |format|
      if @employee.save
---
INSERT INTO `employees` (`address`, `bargain_begin`, `bargain_end`, `c_method`, `company`, `created_at`, `education`, `emp_month`, `empidn`, `empname`, `hire_date`, `hukou`, `insure_base`, `insure_card`, `is_insure`, `is_provident`, `job`, `job_begin`, `lose_card`, `national`, `provident_base`, `py_code`, `remark`, `sex`, `telphone`, `updated_at`) VALUES ('', '2012-01-01', '2012-12-31', 'RR', 32, '2012-03-07', 4, NULL, '370783198707123573', '秀梅', '2012-01-01', 1, 1800.0, '', 1, 1, '', '2012-03-07', '', 1, 2200.0, NULL, NULL, 1, '', '2012-03-07')

  def update
    @employee = Employee.find(params[:id])
    respond_to do |format|
      if @employee.update_attributes(params[:employee])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 15 LIMIT 1
UPDATE `employees` SET `updated_at` = '2012-03-06', `national` = 14, `is_insure` = 1, `empidn` = '421022198509143738' WHERE `employees`.`id` = 16