app/controllers/insure_results_subs_controller.rb

SELECT `insure_results_subs`.* FROM `insure_results_subs` WHERE `insure_results_subs`.`main_id` = 1
SELECT COUNT(*) FROM `insure_results_subs` WHERE `insure_results_subs`.`main_id` = 1
---
  def grid
    @insureResultsSub = InsureResultsSub.where(:main_id => params[:main_id])
    respond_to do |format|
        format.json { render :json => {:success => true , :data => @insureResultsSub , :total => @insureResultsSub.size} }