app/controllers/insure_results_controller.rb

  def calcs_create
      @calcs = Calcs.new(params[:calcs])
      respond_to  do |format|
          if @calcs.save
              format.html { redirect_to @calcs, :notice => 'Calcs was successfully updated.' }
              format.json { render :json => {:data => @calcs ,  :success  => true } }
          else
            format.html { render :action => "edit" }
            format.json { render :json => @calcs.errors, :status => :unprocessable_entity }
          end
      end
  end

  respond_to do |format|
    if @insure_result.save
---
INSERT INTO `calcs` (`company`, `created_at`, `updated_at`, `yearmonth`) VALUES ('30,31', '2012-03-06', '2012-03-06', '')
INSERT INTO `insure_results` (`company`, `created_at`, `emp_id`, `emp_name`, `hukou`, `updated_at`, `yearmonth`) VALUES (30, '2012-03-06', 22, '张三', 1, '2012-03-06', '201202')

  def grid
    @insureResults = InsureResult.paginate options_from_filter({:data => InsureResult})
---
SELECT COUNT(*) FROM `insure_results` WHERE (is_insure LIKE '%0%')
SELECT `insure_results`.* FROM `insure_results` WHERE (hukou LIKE '%1%') LIMIT 20 OFFSET 0