app/controllers/personal_accounts_controller.rb

SELECT COUNT(*) FROM `personal_accounts`
SELECT `personal_accounts`.* FROM `personal_accounts` LIMIT 20 OFFSET 0
---
   def grid
       logger.info("===============================")
       @personalAccount = PersonalAccount.paginate options_from_filter({:data => PersonalAccount})

SELECT `personal_accounts`.* FROM `personal_accounts` WHERE `personal_accounts`.`id` = 2 LIMIT 1
DELETE FROM `personal_accounts` WHERE `personal_accounts`.`id` = 2
---
   def delete
       keys = params[:dlist]
       success = false;
       notice = "";
       if not keys.nil?
           begin
             PersonalAccount.transaction do
                 keys.each do |key|
                   if key != ""
                      @personalAccount = PersonalAccount.find(key)
                      @personalAccount.destroy

SELECT `personal_accounts`.* FROM `personal_accounts` WHERE `personal_accounts`.`id` = 1 LIMIT 1
---
  def edit
    @personal_account = PersonalAccount.find(params[:id])

INSERT INTO `personal_accounts` (`city_id`, `city_name`, `created_at`, `fix_value`, `hukou`, `item_id`, `personal_limit`, `personal_lower`, `personal_round`, `personal_type`, `rate`, `updated_at`) VALUES (420106, '武昌区', '2012-03-06', 34.0, 1, 2, 456.0, 13.0, NULL, 2, 1.0, '2012-03-06')
---
  def create
    @personal_account = PersonalAccount.new(params[:personal_account])

    respond_to do |format|
      if @personal_account.save

SELECT `personal_accounts`.* FROM `personal_accounts` WHERE `personal_accounts`.`id` = 1 LIMIT 1
UPDATE `personal_accounts` SET `personal_round` = 4, `updated_at` = '2012-03-07', `personal_limit` = 256.0 WHERE `personal_accounts`.`id` = 1
---
  def update
    @personal_account = PersonalAccount.find(params[:id])

    respond_to do |format|
      if @personal_account.update_attributes(params[:personal_account])