app/controllers/report_perminum_details_controller.rb

  def submit
    @employees = Employee.all
---
SELECT `employees`.* FROM `employees`