app/controllers/report_providents_controller.rb

SELECT `employees`.* FROM `employees`
---
  def submit
    @employees = Employee.all