app/controllers/sessions_controller.rb

UPDATE `users` SET `salt` = '21718531400.943930516083675', `hashed_password` = 'f7b2fdb2511af00366be5fa9565e8e8ce9d15549', `updated_at` = '2012-03-09' WHERE `users`.`id` = 1
---
  def update_password
     @user = User.authenticate(session[:user_account],params[:old_password])
     respond_to do |format|
       flag = 0
       success = false
        if @user
          @user.password = params[:password]
            if @user.update_attribute("hashed_password",@user.hashed_password)